Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/atdf/PIC32CX5112MTC128S1.atdf
        <register caption="Interrupt Mask Register" name="ACC_IMR" offset="0x2C" rw="R" size="4">
          <bitfield caption="Comparison Edge" mask="0x00000001" name="CE"/>
        </register>
        <register caption="Interrupt Status Register" name="ACC_ISR" offset="0x30" rw="R" size="4">
          <bitfield caption="Comparison Edge (cleared on read)" mask="0x00000001" name="CE"/>
          <bitfield caption="Synchronized Comparator Output" mask="0x00000002" name="SCO"/>
          <bitfield caption="Flag Mask" mask="0x80000000" name="MASK"/>
        </register>
        <register caption="Analog Control Register" name="ACC_ACR" offset="0x94" rw="RW" size="4">
          <bitfield caption="Masking Period Selection" mask="0x00000001" name="MSEL" values="ACC_ACR__MSEL"/>
        </register>
        <register caption="Write Protection Mode Register" name="ACC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Configuration Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="ACC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="ACC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
        </register>
      </register-group>
      <value-group caption="Selection for Minus Comparator Input" name="ACC_MR__SELMINUS">
        <value caption="Selects AD3" name="AD3" value="0x0"/>
        <value caption="Selects AD4" name="AD4" value="0x1"/>
        <value caption="Selects VTEMP" name="VTEMP" value="0x2"/>
        <value caption="Selects VREFTEMP" name="VREFTEMP" value="0x3"/>
      </value-group>
      <value-group caption="Selection For Plus Comparator Input" name="ACC_MR__SELPLUS">
        <value caption="Selects AD0" name="AD0" value="0x0"/>
        <value caption="Selects AD1" name="AD1" value="0x1"/>
        <value caption="Selects AD2" name="AD2" value="0x2"/>
        <value caption="Selects VREFP" name="VREFP" value="0x3"/>
      </value-group>
      <value-group caption="Analog Comparator Enable" name="ACC_MR__ACEN">
        <value caption="Analog comparator disabled." name="DIS" value="0"/>
        <value caption="Analog comparator enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="Edge Type" name="ACC_MR__EDGETYP">
        <value caption="Only rising edge of comparator output" name="RISING" value="0x0"/>
        <value caption="Falling edge of comparator output" name="FALLING" value="0x1"/>
        <value caption="Any edge of comparator output" name="ANY" value="0x2"/>
      </value-group>
      <value-group caption="Invert Comparator Output" name="ACC_MR__INV">
        <value caption="Analog comparator output is directly processed." name="DIS" value="0"/>
        <value caption="Analog comparator output is inverted prior to being processed." name="EN" value="1"/>
      </value-group>
      <value-group caption="Selection Of Fault Source" name="ACC_MR__SELFS">
        <value caption="The CE flag is used to drive the FAULT output." name="CE" value="0"/>
        <value caption="The output of the analog comparator flag is used to drive the FAULT output." name="OUTPUT" value="1"/>
      </value-group>
      <value-group caption="Fault Enable" name="ACC_MR__FE">
        <value caption="The FAULT output is tied to 0." name="DIS" value="0"/>
        <value caption="The FAULT output is driven by the signal defined by SELFS." name="EN" value="1"/>
      </value-group>
      <value-group name="ACC_ACR__MSEL">
        <value name="0" caption="Masks AC output for 16 peripheral clock periods after any write access in ACC_MR or ACC_CR" value="0"/>
        <value name="1" caption="Masks AC output for 128 peripheral clock periods after any write access in ACC_MR or ACC_CR" value="1"/>
      </value-group>
      <value-group caption="Write Protection Key" name="ACC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x414343"/>
      </value-group>
    </module>
    <module caption="Analog-to-Digital Converter" name="ADC" id="44134" version="N">
      <register-group name="ADC">
        <register caption="Control Register" name="ADC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
          <bitfield caption="Start Conversion" mask="0x00000002" name="START"/>
          <bitfield caption="Software FIFO Reset" mask="0x00000008" name="SWFIFO"/>
          <bitfield caption="Comparison Restart" mask="0x00000010" name="CMPRST"/>
        </register>
        <register caption="Mode Register" name="ADC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Trigger Selection" mask="0x0000000E" name="TRGSEL" values="ADC_MR__TRGSEL"/>
          <bitfield caption="Sleep Mode" mask="0x00000020" name="SLEEP" values="ADC_MR__SLEEP"/>
          <bitfield caption="Fast Wake-up" mask="0x00000040" name="FWUP" values="ADC_MR__FWUP"/>
          <bitfield caption="Prescaler Rate Selection" mask="0x0000FF00" name="PRESCAL"/>
          <bitfield caption="Startup Time" mask="0x000F0000" name="STARTUP" values="ADC_MR__STARTUP"/>
          <bitfield caption="Analog Change" mask="0x00800000" name="ANACH" values="ADC_MR__ANACH"/>
          <bitfield caption="Tracking Time" mask="0x0F000000" name="TRACKTIM"/>
          <bitfield caption="Transfer Time" mask="0x30000000" name="TRANSFER"/>
          <bitfield caption="" mask="0x40000000" name="ALWAYS1"/>
          <bitfield caption="User Sequence Enable" mask="0x80000000" name="USEQ" values="ADC_MR__USEQ"/>
        </register>
        <register caption="Channel Sequence Register 1" name="ADC_SEQR1" offset="0x08" rw="RW" size="4">
          <bitfield caption="User Sequence Number 1" mask="0x0000000F" name="USCH1"/>
          <bitfield caption="User Sequence Number 2" mask="0x000000F0" name="USCH2"/>
          <bitfield caption="User Sequence Number 3" mask="0x00000F00" name="USCH3"/>
          <bitfield caption="User Sequence Number 4" mask="0x0000F000" name="USCH4"/>
          <bitfield caption="User Sequence Number 5" mask="0x000F0000" name="USCH5"/>
          <bitfield caption="User Sequence Number 6" mask="0x00F00000" name="USCH6"/>
          <bitfield caption="User Sequence Number 7" mask="0x0F000000" name="USCH7"/>
          <bitfield caption="User Sequence Number 8" mask="0xF0000000" name="USCH8"/>
        </register>
