Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/atdf/PIC32CX5112MTC128S1.atdf
        <register caption="USART Control Register" name="FLEX_US_CR" offset="0x200" rw="W" size="4">
          <bitfield caption="Reset Receiver" mask="0x00000004" name="RSTRX"/>
          <bitfield caption="Reset Transmitter" mask="0x00000008" name="RSTTX"/>
          <bitfield caption="Receiver Enable" mask="0x00000010" name="RXEN"/>
          <bitfield caption="Receiver Disable" mask="0x00000020" name="RXDIS"/>
          <bitfield caption="Transmitter Enable" mask="0x00000040" name="TXEN"/>
          <bitfield caption="Transmitter Disable" mask="0x00000080" name="TXDIS"/>
          <bitfield caption="Reset Status Bits" mask="0x00000100" name="RSTSTA"/>
          <bitfield caption="Start Break" mask="0x00000200" name="STTBRK"/>
          <bitfield caption="Stop Break" mask="0x00000400" name="STPBRK"/>
          <bitfield caption="Clear TIMEOUT Flag and Start Timeout After Next Character Received" mask="0x00000800" name="STTTO"/>
          <bitfield caption="Send Address" mask="0x00001000" name="SENDA"/>
          <bitfield caption="Reset Iterations" mask="0x00002000" name="RSTIT"/>
          <bitfield caption="Reset Non Acknowledge" mask="0x00004000" name="RSTNACK"/>
          <bitfield caption="Start Timeout Immediately" mask="0x00008000" name="RETTO"/>
          <bitfield caption="Request to Send Enable" mask="0x00040000" name="RTSEN"/>
          <bitfield caption="Request to Send Disable" mask="0x00080000" name="RTSDIS"/>
          <bitfield caption="Abort LIN Transmission" mask="0x00100000" name="LINABT"/>
          <bitfield caption="Send LIN Wakeup Signal" mask="0x00200000" name="LINWKUP"/>
          <bitfield caption="Transmit FIFO Clear" mask="0x01000000" name="TXFCLR"/>
          <bitfield caption="Receive FIFO Clear" mask="0x02000000" name="RXFCLR"/>
          <bitfield caption="Transmit FIFO Lock CLEAR" mask="0x04000000" name="TXFLCLR"/>
          <bitfield caption="Request to Clear the Comparison Trigger" mask="0x10000000" name="REQCLR"/>
          <bitfield caption="FIFO Enable" mask="0x40000000" name="FIFOEN"/>
          <bitfield caption="FIFO Disable" mask="0x80000000" name="FIFODIS"/>
        </register>
        <register caption="USART Mode Register" name="FLEX_US_MR" offset="0x204" rw="RW" size="4">
          <mode name="DEFAULT"/>
          <mode name="OOK"/>
          <bitfield caption="USART Mode of Operation" mask="0x0000000F" name="USART_MODE" values="FLEX_US_MR__USART_MODE" modes="DEFAULT"/>
          <bitfield caption="Clock Selection" mask="0x00000030" name="USCLKS" values="FLEX_US_MR__USCLKS" modes="DEFAULT"/>
          <bitfield caption="Character Length" mask="0x000000C0" name="CHRL" values="FLEX_US_MR__CHRL" modes="DEFAULT"/>
          <bitfield caption="Synchronous Mode Select" mask="0x00000100" name="SYNC" modes="DEFAULT"/>
          <bitfield caption="Parity Type" mask="0x00000E00" name="PAR" values="FLEX_US_MR__PAR" modes="DEFAULT"/>
          <bitfield caption="Number of Stop Bits" mask="0x00003000" name="NBSTOP" values="FLEX_US_MR__NBSTOP" modes="DEFAULT"/>
          <bitfield caption="Channel Mode" mask="0x0000C000" name="CHMODE" values="FLEX_US_MR__CHMODE" modes="DEFAULT"/>
          <bitfield caption="Bit Order" mask="0x00010000" name="MSBF" modes="DEFAULT"/>
          <bitfield caption="9-bit Character Length" mask="0x00020000" name="MODE9" modes="DEFAULT"/>
          <bitfield caption="Clock Output Select" mask="0x00040000" name="CLKO" modes="DEFAULT"/>
          <bitfield caption="Oversampling Mode" mask="0x00080000" name="OVER" modes="DEFAULT"/>
          <bitfield caption="Inhibit Non Acknowledge" mask="0x00100000" name="INACK" modes="DEFAULT"/>
          <bitfield caption="Disable Successive NACK" mask="0x00200000" name="DSNACK" modes="DEFAULT"/>
          <bitfield caption="Variable Synchronization of Command/Data Sync Start Frame Delimiter" mask="0x00400000" name="VAR_SYNC" modes="DEFAULT"/>
          <bitfield caption="Inverted Data" mask="0x00800000" name="INVDATA" modes="DEFAULT"/>
          <bitfield caption="Maximum Number of Automatic Iteration" mask="0x07000000" name="MAX_ITERATION" modes="DEFAULT"/>
          <bitfield caption="Receive Line Filter" mask="0x10000000" name="FILTER" modes="DEFAULT"/>
          <bitfield caption="Manchester Encoder/Decoder Enable" mask="0x20000000" name="MAN" modes="DEFAULT"/>
          <bitfield caption="Manchester Synchronization Mode" mask="0x40000000" name="MODSYNC" modes="DEFAULT"/>
          <bitfield caption="Start Frame Delimiter Selector" mask="0x80000000" name="ONEBIT" modes="DEFAULT"/>
          <bitfield caption="USART Mode of Operation" mask="0x0000000F" name="USART_MODE" values="FLEX_US_MR_OOK__USART_MODE" modes="OOK"/>
          <bitfield caption="Clock Selection" mask="0x00000030" name="USCLKS" values="FLEX_US_MR_OOK__USCLKS" modes="OOK"/>
          <bitfield caption="Character Length" mask="0x000000C0" name="CHRL" values="FLEX_US_MR_OOK__CHRL" modes="OOK"/>
          <bitfield caption="Synchronous Mode Select" mask="0x00000100" name="SYNC" modes="OOK"/>
          <bitfield caption="Parity Type" mask="0x00000E00" name="PAR" values="FLEX_US_MR_OOK__PAR" modes="OOK"/>
          <bitfield caption="Number of Stop Bits" mask="0x00003000" name="NBSTOP" values="FLEX_US_MR_OOK__NBSTOP" modes="OOK"/>
          <bitfield caption="Channel Mode" mask="0x0000C000" name="CHMODE" values="FLEX_US_MR_OOK__CHMODE" modes="OOK"/>
          <bitfield caption="Bit Order" mask="0x00010000" name="MSBF" modes="OOK"/>
          <bitfield caption="9-bit Character Length" mask="0x00020000" name="MODE9" modes="OOK"/>
          <bitfield caption="Clock Output Select" mask="0x00040000" name="CLKO" modes="OOK"/>
          <bitfield caption="Oversampling Mode" mask="0x00080000" name="OVER" modes="OOK"/>
          <bitfield caption="OOK Demodulation Input Selection" mask="0x00100000" name="OOKRXD" modes="OOK"/>
          <bitfield caption="OOK Modulation/Demodulation Enabled" mask="0x00200000" name="OOKEN" modes="OOK"/>
          <bitfield caption="Receive Line Filter" mask="0x10000000" name="FILTER" modes="OOK"/>
        </register>
        <register caption="USART Interrupt Enable Register" name="FLEX_US_IER" offset="0x208" rw="W" size="4">
          <mode name="DEFAULT"/>
          <mode name="LIN_MODE"/>
          <bitfield caption="RXRDY Interrupt Enable" mask="0x00000001" name="RXRDY" modes="DEFAULT"/>
          <bitfield caption="TXRDY Interrupt Enable" mask="0x00000002" name="TXRDY" modes="DEFAULT"/>
          <bitfield caption="Receiver Break Interrupt Enable" mask="0x00000004" name="RXBRK" modes="DEFAULT"/>
          <bitfield caption="End of Receive Transfer Interrupt Enable (available in all USART modes of operation)" mask="0x00000008" name="ENDRX" modes="DEFAULT"/>
          <bitfield caption="End of Transmit Interrupt Enable (available in all USART modes of operation)" mask="0x00000010" name="ENDTX" modes="DEFAULT"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000020" name="OVRE" modes="DEFAULT"/>
          <bitfield caption="Framing Error Interrupt Enable" mask="0x00000040" name="FRAME" modes="DEFAULT"/>
          <bitfield caption="Parity Error Interrupt Enable" mask="0x00000080" name="PARE" modes="DEFAULT"/>
          <bitfield caption="Timeout Interrupt Enable" mask="0x00000100" name="TIMEOUT" modes="DEFAULT"/>
          <bitfield caption="TXEMPTY Interrupt Enable" mask="0x00000200" name="TXEMPTY" modes="DEFAULT"/>
          <bitfield caption="Max number of Repetitions Reached Interrupt Enable" mask="0x00000400" name="ITER" modes="DEFAULT"/>
          <bitfield caption="Buffer Empty Interrupt Enable (available in all USART modes of operation)" mask="0x00000800" name="TXBUFE" modes="DEFAULT"/>
          <bitfield caption="Buffer Full Interrupt Enable (available in all USART modes of operation)" mask="0x00001000" name="RXBUFF" modes="DEFAULT"/>
          <bitfield caption="Non Acknowledge Interrupt Enable" mask="0x00002000" name="NACK" modes="DEFAULT"/>
          <bitfield caption="Clear to Send Input Change Interrupt Enable" mask="0x00080000" name="CTSIC" modes="DEFAULT"/>
          <bitfield caption="Comparison Interrupt Enable" mask="0x00400000" name="CMP" modes="DEFAULT"/>
          <bitfield caption="Manchester Error Interrupt Enable" mask="0x01000000" name="MANE" modes="DEFAULT"/>
          <bitfield caption="RXRDY Interrupt Enable" mask="0x00000001" name="RXRDY" modes="LIN_MODE"/>
          <bitfield caption="TXRDY Interrupt Enable" mask="0x00000002" name="TXRDY" modes="LIN_MODE"/>
          <bitfield caption="End of Receive Transfer Interrupt Enable" mask="0x00000008" name="ENDRX" modes="LIN_MODE"/>
          <bitfield caption="End of Transmit Interrupt Enable" mask="0x00000010" name="ENDTX" modes="LIN_MODE"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000020" name="OVRE" modes="LIN_MODE"/>
          <bitfield caption="Framing Error Interrupt Enable" mask="0x00000040" name="FRAME" modes="LIN_MODE"/>
          <bitfield caption="Parity Error Interrupt Enable" mask="0x00000080" name="PARE" modes="LIN_MODE"/>
          <bitfield caption="Timeout Interrupt Enable" mask="0x00000100" name="TIMEOUT" modes="LIN_MODE"/>
          <bitfield caption="TXEMPTY Interrupt Enable" mask="0x00000200" name="TXEMPTY" modes="LIN_MODE"/>
          <bitfield caption="Buffer Empty Interrupt Enable" mask="0x00000800" name="TXBUFE" modes="LIN_MODE"/>
          <bitfield caption="Buffer Full Interrupt Enable" mask="0x00001000" name="RXBUFF" modes="LIN_MODE"/>
          <bitfield caption="LIN Break Sent or LIN Break Received Interrupt Enable" mask="0x00002000" name="LINBK" modes="LIN_MODE"/>
          <bitfield caption="LIN Identifier Sent or LIN Identifier Received Interrupt Enable" mask="0x00004000" name="LINID" modes="LIN_MODE"/>
          <bitfield caption="LIN Transfer Completed Interrupt Enable" mask="0x00008000" name="LINTC" modes="LIN_MODE"/>
          <bitfield caption="LIN Bus Error Interrupt Enable" mask="0x02000000" name="LINBE" modes="LIN_MODE"/>
          <bitfield caption="LIN Inconsistent Synch Field Error Interrupt Enable" mask="0x04000000" name="LINISFE" modes="LIN_MODE"/>
          <bitfield caption="LIN Identifier Parity Interrupt Enable" mask="0x08000000" name="LINIPE" modes="LIN_MODE"/>
          <bitfield caption="LIN Checksum Error Interrupt Enable" mask="0x10000000" name="LINCE" modes="LIN_MODE"/>
          <bitfield caption="LIN Client Not Responding Error Interrupt Enable" mask="0x20000000" name="LINSNRE" modes="LIN_MODE"/>
          <bitfield caption="LIN Synch Tolerance Error Interrupt Enable" mask="0x40000000" name="LINSTE" modes="LIN_MODE"/>
          <bitfield caption="LIN Header Timeout Error Interrupt Enable" mask="0x80000000" name="LINHTE" modes="LIN_MODE"/>
        </register>
        <register caption="USART Interrupt Disable Register" name="FLEX_US_IDR" offset="0x20C" rw="W" size="4">
          <mode name="DEFAULT"/>
          <mode name="LIN_MODE"/>
          <bitfield caption="RXRDY Interrupt Disable" mask="0x00000001" name="RXRDY" modes="DEFAULT"/>
          <bitfield caption="TXRDY Interrupt Disable" mask="0x00000002" name="TXRDY" modes="DEFAULT"/>
          <bitfield caption="Receiver Break Interrupt Disable" mask="0x00000004" name="RXBRK" modes="DEFAULT"/>
          <bitfield caption="End of Receive Transfer Interrupt Disable (available in all USART modes of operation)" mask="0x00000008" name="ENDRX" modes="DEFAULT"/>
          <bitfield caption="End of Transmit Interrupt Disable (available in all USART modes of operation)" mask="0x00000010" name="ENDTX" modes="DEFAULT"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000020" name="OVRE" modes="DEFAULT"/>
          <bitfield caption="Framing Error Interrupt Disable" mask="0x00000040" name="FRAME" modes="DEFAULT"/>
          <bitfield caption="Parity Error Interrupt Disable" mask="0x00000080" name="PARE" modes="DEFAULT"/>
          <bitfield caption="Timeout Interrupt Disable" mask="0x00000100" name="TIMEOUT" modes="DEFAULT"/>
          <bitfield caption="TXEMPTY Interrupt Disable" mask="0x00000200" name="TXEMPTY" modes="DEFAULT"/>
          <bitfield caption="Max Number of Repetitions Reached Interrupt Disable" mask="0x00000400" name="ITER" modes="DEFAULT"/>
          <bitfield caption="Buffer Empty Interrupt Disable (available in all USART modes of operation)" mask="0x00000800" name="TXBUFE" modes="DEFAULT"/>
          <bitfield caption="Buffer Full Interrupt Disable (available in all USART modes of operation)" mask="0x00001000" name="RXBUFF" modes="DEFAULT"/>
          <bitfield caption="Non Acknowledge Interrupt Disable" mask="0x00002000" name="NACK" modes="DEFAULT"/>
          <bitfield caption="Clear to Send Input Change Interrupt Disable" mask="0x00080000" name="CTSIC" modes="DEFAULT"/>
          <bitfield caption="Comparison Interrupt Disable" mask="0x00400000" name="CMP" modes="DEFAULT"/>
          <bitfield caption="Manchester Error Interrupt Disable" mask="0x01000000" name="MANE" modes="DEFAULT"/>
          <bitfield caption="RXRDY Interrupt Disable" mask="0x00000001" name="RXRDY" modes="LIN_MODE"/>
          <bitfield caption="TXRDY Interrupt Disable" mask="0x00000002" name="TXRDY" modes="LIN_MODE"/>
          <bitfield caption="End of Receive Transfer Interrupt Disable" mask="0x00000008" name="ENDRX" modes="LIN_MODE"/>
          <bitfield caption="End of Transmit Interrupt Disable" mask="0x00000010" name="ENDTX" modes="LIN_MODE"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000020" name="OVRE" modes="LIN_MODE"/>
          <bitfield caption="Framing Error Interrupt Disable" mask="0x00000040" name="FRAME" modes="LIN_MODE"/>
          <bitfield caption="Parity Error Interrupt Disable" mask="0x00000080" name="PARE" modes="LIN_MODE"/>
          <bitfield caption="Timeout Interrupt Disable" mask="0x00000100" name="TIMEOUT" modes="LIN_MODE"/>
          <bitfield caption="TXEMPTY Interrupt Disable" mask="0x00000200" name="TXEMPTY" modes="LIN_MODE"/>
          <bitfield caption="Buffer Empty Interrupt Disable" mask="0x00000800" name="TXBUFE" modes="LIN_MODE"/>
          <bitfield caption="Buffer Full Interrupt Disable" mask="0x00001000" name="RXBUFF" modes="LIN_MODE"/>
          <bitfield caption="LIN Break Sent or LIN Break Received Interrupt Disable" mask="0x00002000" name="LINBK" modes="LIN_MODE"/>
          <bitfield caption="LIN Identifier Sent or LIN Identifier Received Interrupt Disable" mask="0x00004000" name="LINID" modes="LIN_MODE"/>
          <bitfield caption="LIN Transfer Completed Interrupt Disable" mask="0x00008000" name="LINTC" modes="LIN_MODE"/>
          <bitfield caption="LIN Bus Error Interrupt Disable" mask="0x02000000" name="LINBE" modes="LIN_MODE"/>
          <bitfield caption="LIN Inconsistent Synch Field Error Interrupt Disable" mask="0x04000000" name="LINISFE" modes="LIN_MODE"/>
          <bitfield caption="LIN Identifier Parity Interrupt Disable" mask="0x08000000" name="LINIPE" modes="LIN_MODE"/>
          <bitfield caption="LIN Checksum Error Interrupt Disable" mask="0x10000000" name="LINCE" modes="LIN_MODE"/>
          <bitfield caption="LIN Client Not Responding Error Interrupt Disable" mask="0x20000000" name="LINSNRE" modes="LIN_MODE"/>
          <bitfield caption="LIN Synch Tolerance Error Interrupt Disable" mask="0x40000000" name="LINSTE" modes="LIN_MODE"/>
          <bitfield caption="LIN Header Timeout Error Interrupt Disable" mask="0x80000000" name="LINHTE" modes="LIN_MODE"/>
        </register>
        <register caption="USART Interrupt Mask Register" name="FLEX_US_IMR" offset="0x210" rw="R" size="4">
          <mode name="DEFAULT"/>
          <mode name="LIN_MODE"/>
          <bitfield caption="RXRDY Interrupt Mask" mask="0x00000001" name="RXRDY" modes="DEFAULT"/>
          <bitfield caption="TXRDY Interrupt Mask" mask="0x00000002" name="TXRDY" modes="DEFAULT"/>
          <bitfield caption="Receiver Break Interrupt Mask" mask="0x00000004" name="RXBRK" modes="DEFAULT"/>
          <bitfield caption="End of Receive Transfer Interrupt Mask (available in all USART modes of operation)" mask="0x00000008" name="ENDRX" modes="DEFAULT"/>
          <bitfield caption="End of Transmit Interrupt Mask (available in all USART modes of operation)" mask="0x00000010" name="ENDTX" modes="DEFAULT"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000020" name="OVRE" modes="DEFAULT"/>
          <bitfield caption="Framing Error Interrupt Mask" mask="0x00000040" name="FRAME" modes="DEFAULT"/>
          <bitfield caption="Parity Error Interrupt Mask" mask="0x00000080" name="PARE" modes="DEFAULT"/>
          <bitfield caption="Timeout Interrupt Mask" mask="0x00000100" name="TIMEOUT" modes="DEFAULT"/>
          <bitfield caption="TXEMPTY Interrupt Mask" mask="0x00000200" name="TXEMPTY" modes="DEFAULT"/>
          <bitfield caption="Max Number of Repetitions Reached Interrupt Mask" mask="0x00000400" name="ITER" modes="DEFAULT"/>
          <bitfield caption="Buffer Empty Interrupt Mask (available in all USART modes of operation)" mask="0x00000800" name="TXBUFE" modes="DEFAULT"/>
          <bitfield caption="Buffer Full Interrupt Mask (available in all USART modes of operation)" mask="0x00001000" name="RXBUFF" modes="DEFAULT"/>
          <bitfield caption="Non Acknowledge Interrupt Mask" mask="0x00002000" name="NACK" modes="DEFAULT"/>
          <bitfield caption="Clear to Send Input Change Interrupt Mask" mask="0x00080000" name="CTSIC" modes="DEFAULT"/>
          <bitfield caption="Comparison Interrupt Mask" mask="0x00400000" name="CMP" modes="DEFAULT"/>
          <bitfield caption="Manchester Error Interrupt Mask" mask="0x01000000" name="MANE" modes="DEFAULT"/>
          <bitfield caption="RXRDY Interrupt Mask" mask="0x00000001" name="RXRDY" modes="LIN_MODE"/>
          <bitfield caption="TXRDY Interrupt Mask" mask="0x00000002" name="TXRDY" modes="LIN_MODE"/>
          <bitfield caption="End of Receive Transfer Interrupt Mask" mask="0x00000008" name="ENDRX" modes="LIN_MODE"/>
          <bitfield caption="End of Transmit Interrupt Mask" mask="0x00000010" name="ENDTX" modes="LIN_MODE"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000020" name="OVRE" modes="LIN_MODE"/>
          <bitfield caption="Framing Error Interrupt Mask" mask="0x00000040" name="FRAME" modes="LIN_MODE"/>
          <bitfield caption="Parity Error Interrupt Mask" mask="0x00000080" name="PARE" modes="LIN_MODE"/>
          <bitfield caption="Timeout Interrupt Mask" mask="0x00000100" name="TIMEOUT" modes="LIN_MODE"/>
          <bitfield caption="TXEMPTY Interrupt Mask" mask="0x00000200" name="TXEMPTY" modes="LIN_MODE"/>
          <bitfield caption="Buffer Empty Interrupt Mask" mask="0x00000800" name="TXBUFE" modes="LIN_MODE"/>
          <bitfield caption="Buffer Full Interrupt Mask" mask="0x00001000" name="RXBUFF" modes="LIN_MODE"/>
          <bitfield caption="LIN Break Sent or LIN Break Received Interrupt Mask" mask="0x00002000" name="LINBK" modes="LIN_MODE"/>
          <bitfield caption="LIN Identifier Sent or LIN Identifier Received Interrupt Mask" mask="0x00004000" name="LINID" modes="LIN_MODE"/>
          <bitfield caption="LIN Transfer Completed Interrupt Mask" mask="0x00008000" name="LINTC" modes="LIN_MODE"/>
          <bitfield caption="LIN Bus Error Interrupt Mask" mask="0x02000000" name="LINBE" modes="LIN_MODE"/>
          <bitfield caption="LIN Inconsistent Synch Field Error Interrupt Mask" mask="0x04000000" name="LINISFE" modes="LIN_MODE"/>
          <bitfield caption="LIN Identifier Parity Interrupt Mask" mask="0x08000000" name="LINIPE" modes="LIN_MODE"/>
          <bitfield caption="LIN Checksum Error Interrupt Mask" mask="0x10000000" name="LINCE" modes="LIN_MODE"/>
          <bitfield caption="LIN Client Not Responding Error Interrupt Mask" mask="0x20000000" name="LINSNRE" modes="LIN_MODE"/>
          <bitfield caption="LIN Synch Tolerance Error Interrupt Mask" mask="0x40000000" name="LINSTE" modes="LIN_MODE"/>
          <bitfield caption="LIN Header Timeout Error Interrupt Mask" mask="0x80000000" name="LINHTE" modes="LIN_MODE"/>
        </register>
