Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/atdf/PIC32CX5112MTC128S1.atdf
        <register caption="Master Error Status Register" name="MATRIX_MESR" offset="0x015C" rw="R" size="4">
          <bitfield caption="Master 0 Access Error" mask="0x00000001" name="MERR0"/>
          <bitfield caption="Master 1 Access Error" mask="0x00000002" name="MERR1"/>
          <bitfield caption="Master 2 Access Error" mask="0x00000004" name="MERR2"/>
          <bitfield caption="Master 3 Access Error" mask="0x00000008" name="MERR3"/>
          <bitfield caption="Master 4 Access Error" mask="0x00000010" name="MERR4"/>
          <bitfield caption="Master 5 Access Error" mask="0x00000020" name="MERR5"/>
          <bitfield caption="Master 6 Access Error" mask="0x00000040" name="MERR6"/>
          <bitfield caption="Master 7 Access Error" mask="0x00000080" name="MERR7"/>
          <bitfield caption="Master 8 Access Error" mask="0x00000100" name="MERR8"/>
          <bitfield caption="Master 9 Access Error" mask="0x00000200" name="MERR9"/>
          <bitfield caption="Master 10 Access Error" mask="0x00000400" name="MERR10"/>
          <bitfield caption="Master 11 Access Error" mask="0x00000800" name="MERR11"/>
          <bitfield caption="Master 12 Access Error" mask="0x00001000" name="MERR12"/>
          <bitfield caption="Master 13 Access Error" mask="0x00002000" name="MERR13"/>
          <bitfield caption="Master 14 Access Error" mask="0x00004000" name="MERR14"/>
          <bitfield caption="Master 15 Access Error" mask="0x00008000" name="MERR15"/>
        </register>
        <register caption="Master 0 Error Address Register" name="MATRIX_MEAR" offset="0x0160" rw="R" size="4" count="16">
          <bitfield caption="Master Error Address" mask="0xFFFFFFFF" name="ERRADD"/>
        </register>
        <register caption="Write Protect Mode Register" name="MATRIX_WPMR" offset="0x01E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Configuration Freeze" mask="0x00000080" name="CFGFRZ"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="MATRIX_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protect Status Register" name="MATRIX_WPSR" offset="0x01E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Version Register" name="MATRIX_VERSION" offset="0x01FC" rw="R" size="4">
          <bitfield caption="Matrix Version" mask="0x00000FFF" name="VERSION"/>
          <bitfield caption="Metal Fix Number" mask="0x00070000" name="MFN"/>
        </register>
        <register caption="Protection Slave 0 Register" name="MATRIX_PSR" offset="0x0200" rw="RW" size="4" count="16">
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000001" name="LAUSERH0"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000002" name="LAUSERH1"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000004" name="LAUSERH2"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000008" name="LAUSERH3"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000010" name="LAUSERH4"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000020" name="LAUSERH5"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000040" name="LAUSERH6"/>
          <bitfield caption="Low Area USER in HSELx Protected Region" mask="0x00000080" name="LAUSERH7"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000100" name="RDUSERH0"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000200" name="RDUSERH1"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000400" name="RDUSERH2"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00000800" name="RDUSERH3"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00001000" name="RDUSERH4"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00002000" name="RDUSERH5"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00004000" name="RDUSERH6"/>
          <bitfield caption="Read USER for HSELx Protected Region" mask="0x00008000" name="RDUSERH7"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00010000" name="WRUSERH0"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00020000" name="WRUSERH1"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00040000" name="WRUSERH2"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00080000" name="WRUSERH3"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00100000" name="WRUSERH4"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00200000" name="WRUSERH5"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00400000" name="WRUSERH6"/>
          <bitfield caption="Write USER for HSELx Protected Region" mask="0x00800000" name="WRUSERH7"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x01000000" name="DPSOA0"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x02000000" name="DPSOA1"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x04000000" name="DPSOA2"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x08000000" name="DPSOA3"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x10000000" name="DPSOA4"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x20000000" name="DPSOA5"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x40000000" name="DPSOA6"/>
          <bitfield caption="Downward Protection Split Address for HSELx Protected Region" mask="0x80000000" name="DPSOA7"/>
        </register>
        <register caption="Protected Areas Split Slave 0 Register" name="MATRIX_PASSR" offset="0x0240" rw="RW" size="4" count="16">
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000000F" name="PASPLIT0"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000000F0" name="PASPLIT1"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00000F00" name="PASPLIT2"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0000F000" name="PASPLIT3"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x000F0000" name="PASPLIT4"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x00F00000" name="PASPLIT5"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0x0F000000" name="PASPLIT6"/>
          <bitfield caption="Protected Areas Split for HSELx Protected Region" mask="0xF0000000" name="PASPLIT7"/>
        </register>
        <register caption="Protected Region Top Slave 0 Register" name="MATRIX_PRTSR" offset="0x0280" rw="RW" size="4" count="16">
          <bitfield caption="HSELx Protected Region Top" mask="0x0000000F" name="PRTOP0"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000000F0" name="PRTOP1"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00000F00" name="PRTOP2"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0000F000" name="PRTOP3"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x000F0000" name="PRTOP4"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x00F00000" name="PRTOP5"/>
          <bitfield caption="HSELx Protected Region Top" mask="0x0F000000" name="PRTOP6"/>
          <bitfield caption="HSELx Protected Region Top" mask="0xF0000000" name="PRTOP7"/>
        </register>
        <register caption="Protected Peripheral Select 1 Register" name="MATRIX_PPSELR" offset="0x02C0" rw="RW" size="4" count="3">
          <bitfield caption="User PSELy Peripheral" mask="0x00000001" name="USERP0"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000002" name="USERP1"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000004" name="USERP2"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000008" name="USERP3"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000010" name="USERP4"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000020" name="USERP5"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000040" name="USERP6"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000080" name="USERP7"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000100" name="USERP8"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000200" name="USERP9"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000400" name="USERP10"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00000800" name="USERP11"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00001000" name="USERP12"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00002000" name="USERP13"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00004000" name="USERP14"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00008000" name="USERP15"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00010000" name="USERP16"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00020000" name="USERP17"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00040000" name="USERP18"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00080000" name="USERP19"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00100000" name="USERP20"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00200000" name="USERP21"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00400000" name="USERP22"/>
          <bitfield caption="User PSELy Peripheral" mask="0x00800000" name="USERP23"/>
          <bitfield caption="User PSELy Peripheral" mask="0x01000000" name="USERP24"/>
          <bitfield caption="User PSELy Peripheral" mask="0x02000000" name="USERP25"/>
          <bitfield caption="User PSELy Peripheral" mask="0x04000000" name="USERP26"/>
          <bitfield caption="User PSELy Peripheral" mask="0x08000000" name="USERP27"/>
          <bitfield caption="User PSELy Peripheral" mask="0x10000000" name="USERP28"/>
          <bitfield caption="User PSELy Peripheral" mask="0x20000000" name="USERP29"/>
          <bitfield caption="User PSELy Peripheral" mask="0x40000000" name="USERP30"/>
          <bitfield caption="User PSELy Peripheral" mask="0x80000000" name="USERP31"/>
        </register>
      </register-group>
      <value-group caption="Undefined Length Burst Type" name="MATRIX_MCFG__ULBT">
        <value caption="Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next system bus 1 Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts. This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave." name="UNLIMITED" value="0x0"/>
        <value caption="Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence." name="SINGLE" value="0x1"/>
        <value caption="4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats." name="_4_BEAT" value="0x2"/>
        <value caption="8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats." name="_8_BEAT" value="0x3"/>
        <value caption="16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats." name="_16_BEAT" value="0x4"/>
        <value caption="32-beat Burst-The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats." name="_32_BEAT" value="0x5"/>
        <value caption="64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats." name="_64_BEAT" value="0x6"/>
        <value caption="128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats. Unless duly needed, the ULBT should be left at its default 0 value for power saving." name="_128_BEAT" value="0x7"/>
      </value-group>
