Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/atdf/PIC32CX5112MTC128S1.atdf
        <register caption="PIO Privilege Pin Data Status Register (p_iogroup = 0)" name="PIO_P_PDSR" offset="0x8" rw="R" size="4">
          <bitfield caption="Input Data Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Input Data Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Input Data Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Input Data Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Input Data Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Input Data Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Input Data Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Input Data Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Input Data Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Input Data Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Input Data Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Input Data Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Input Data Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Input Data Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Input Data Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Input Data Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Input Data Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Input Data Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Input Data Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Input Data Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Input Data Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Input Data Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Input Data Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Input Data Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Input Data Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Input Data Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Input Data Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Input Data Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Input Data Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Input Data Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Input Data Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Input Data Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Privilege Lock Status Register (p_iogroup = 0)" name="PIO_P_LOCKSR" offset="0xC" rw="R" size="4">
          <bitfield caption="Lock Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Lock Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Lock Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Lock Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Lock Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Lock Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Lock Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Lock Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Lock Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Lock Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Lock Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Lock Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Lock Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Lock Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Lock Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Lock Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Lock Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Lock Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Lock Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Lock Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Lock Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Lock Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Lock Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Lock Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Lock Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Lock Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Lock Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Lock Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Lock Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Lock Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Lock Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Lock Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Privilege Set Output Data Register (p_iogroup = 0)" name="PIO_P_SODR" offset="0x10" rw="W" size="4">
          <bitfield caption="Set Output Data" mask="0x00000001" name="P0"/>
          <bitfield caption="Set Output Data" mask="0x00000002" name="P1"/>
          <bitfield caption="Set Output Data" mask="0x00000004" name="P2"/>
          <bitfield caption="Set Output Data" mask="0x00000008" name="P3"/>
          <bitfield caption="Set Output Data" mask="0x00000010" name="P4"/>
          <bitfield caption="Set Output Data" mask="0x00000020" name="P5"/>
          <bitfield caption="Set Output Data" mask="0x00000040" name="P6"/>
          <bitfield caption="Set Output Data" mask="0x00000080" name="P7"/>
          <bitfield caption="Set Output Data" mask="0x00000100" name="P8"/>
          <bitfield caption="Set Output Data" mask="0x00000200" name="P9"/>
          <bitfield caption="Set Output Data" mask="0x00000400" name="P10"/>
          <bitfield caption="Set Output Data" mask="0x00000800" name="P11"/>
          <bitfield caption="Set Output Data" mask="0x00001000" name="P12"/>
          <bitfield caption="Set Output Data" mask="0x00002000" name="P13"/>
          <bitfield caption="Set Output Data" mask="0x00004000" name="P14"/>
          <bitfield caption="Set Output Data" mask="0x00008000" name="P15"/>
          <bitfield caption="Set Output Data" mask="0x00010000" name="P16"/>
          <bitfield caption="Set Output Data" mask="0x00020000" name="P17"/>
          <bitfield caption="Set Output Data" mask="0x00040000" name="P18"/>
          <bitfield caption="Set Output Data" mask="0x00080000" name="P19"/>
          <bitfield caption="Set Output Data" mask="0x00100000" name="P20"/>
          <bitfield caption="Set Output Data" mask="0x00200000" name="P21"/>
          <bitfield caption="Set Output Data" mask="0x00400000" name="P22"/>
          <bitfield caption="Set Output Data" mask="0x00800000" name="P23"/>
          <bitfield caption="Set Output Data" mask="0x01000000" name="P24"/>
          <bitfield caption="Set Output Data" mask="0x02000000" name="P25"/>
          <bitfield caption="Set Output Data" mask="0x04000000" name="P26"/>
          <bitfield caption="Set Output Data" mask="0x08000000" name="P27"/>
          <bitfield caption="Set Output Data" mask="0x10000000" name="P28"/>
          <bitfield caption="Set Output Data" mask="0x20000000" name="P29"/>
          <bitfield caption="Set Output Data" mask="0x40000000" name="P30"/>
          <bitfield caption="Set Output Data" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Privilege Clear Output Data Register (p_iogroup = 0)" name="PIO_P_CODR" offset="0x14" rw="W" size="4">
          <bitfield caption="Clear Output Data" mask="0x00000001" name="P0"/>
          <bitfield caption="Clear Output Data" mask="0x00000002" name="P1"/>
          <bitfield caption="Clear Output Data" mask="0x00000004" name="P2"/>
          <bitfield caption="Clear Output Data" mask="0x00000008" name="P3"/>
          <bitfield caption="Clear Output Data" mask="0x00000010" name="P4"/>
          <bitfield caption="Clear Output Data" mask="0x00000020" name="P5"/>
          <bitfield caption="Clear Output Data" mask="0x00000040" name="P6"/>
          <bitfield caption="Clear Output Data" mask="0x00000080" name="P7"/>
          <bitfield caption="Clear Output Data" mask="0x00000100" name="P8"/>
          <bitfield caption="Clear Output Data" mask="0x00000200" name="P9"/>
          <bitfield caption="Clear Output Data" mask="0x00000400" name="P10"/>
          <bitfield caption="Clear Output Data" mask="0x00000800" name="P11"/>
          <bitfield caption="Clear Output Data" mask="0x00001000" name="P12"/>
          <bitfield caption="Clear Output Data" mask="0x00002000" name="P13"/>
          <bitfield caption="Clear Output Data" mask="0x00004000" name="P14"/>
          <bitfield caption="Clear Output Data" mask="0x00008000" name="P15"/>
          <bitfield caption="Clear Output Data" mask="0x00010000" name="P16"/>
          <bitfield caption="Clear Output Data" mask="0x00020000" name="P17"/>
          <bitfield caption="Clear Output Data" mask="0x00040000" name="P18"/>
          <bitfield caption="Clear Output Data" mask="0x00080000" name="P19"/>
          <bitfield caption="Clear Output Data" mask="0x00100000" name="P20"/>
          <bitfield caption="Clear Output Data" mask="0x00200000" name="P21"/>
          <bitfield caption="Clear Output Data" mask="0x00400000" name="P22"/>
          <bitfield caption="Clear Output Data" mask="0x00800000" name="P23"/>
          <bitfield caption="Clear Output Data" mask="0x01000000" name="P24"/>
          <bitfield caption="Clear Output Data" mask="0x02000000" name="P25"/>
          <bitfield caption="Clear Output Data" mask="0x04000000" name="P26"/>
          <bitfield caption="Clear Output Data" mask="0x08000000" name="P27"/>
          <bitfield caption="Clear Output Data" mask="0x10000000" name="P28"/>
          <bitfield caption="Clear Output Data" mask="0x20000000" name="P29"/>
          <bitfield caption="Clear Output Data" mask="0x40000000" name="P30"/>
          <bitfield caption="Clear Output Data" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Privilege Output Data Status Register (p_iogroup = 0)" name="PIO_P_ODSR" offset="0x18" rw="RW" size="4">
          <bitfield caption="Output Data Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Data Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Data Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Data Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Data Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Data Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Data Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Data Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Data Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Data Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Data Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Data Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Data Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Data Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Data Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Data Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Data Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Data Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Data Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Data Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Data Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Data Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Data Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Data Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Data Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Data Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Data Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Data Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Data Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Data Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Data Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Data Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Privilege Interrupt Enable Register (p_iogroup = 0)" name="PIO_P_IER" offset="0x20" rw="W" size="4">
          <bitfield caption="Input Change Interrupt Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="Input Change Interrupt Enable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Privilege Interrupt Disable Register (p_iogroup = 0)" name="PIO_P_IDR" offset="0x24" rw="W" size="4">
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000001" name="P0"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000002" name="P1"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000004" name="P2"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000008" name="P3"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000010" name="P4"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000020" name="P5"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000040" name="P6"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000080" name="P7"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000100" name="P8"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000200" name="P9"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000400" name="P10"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00000800" name="P11"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00001000" name="P12"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00002000" name="P13"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00004000" name="P14"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00008000" name="P15"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00010000" name="P16"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00020000" name="P17"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00040000" name="P18"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00080000" name="P19"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00100000" name="P20"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00200000" name="P21"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00400000" name="P22"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x00800000" name="P23"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x01000000" name="P24"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x02000000" name="P25"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x04000000" name="P26"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x08000000" name="P27"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x10000000" name="P28"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x20000000" name="P29"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x40000000" name="P30"/>
          <bitfield caption="Input Change Interrupt Disable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Privilege Interrupt Mask Register (p_iogroup = 0)" name="PIO_P_IMR" offset="0x28" rw="R" size="4">
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000001" name="P0"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000002" name="P1"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000004" name="P2"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000008" name="P3"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000010" name="P4"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000020" name="P5"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000040" name="P6"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000080" name="P7"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000100" name="P8"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000200" name="P9"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000400" name="P10"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00000800" name="P11"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00001000" name="P12"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00002000" name="P13"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00004000" name="P14"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00008000" name="P15"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00010000" name="P16"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00020000" name="P17"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00040000" name="P18"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00080000" name="P19"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00100000" name="P20"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00200000" name="P21"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00400000" name="P22"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x00800000" name="P23"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x01000000" name="P24"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x02000000" name="P25"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x04000000" name="P26"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x08000000" name="P27"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x10000000" name="P28"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x20000000" name="P29"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x40000000" name="P30"/>
          <bitfield caption="Input Change Interrupt Mask" mask="0x80000000" name="P31"/>
        </register>
