Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/atdf/PIC32CX5112MTC128S1.atdf
        <register caption="SRAM Configuration Register" name="SFR_SRAM" offset="0x28" rw="RW" size="4" count="2">
          <bitfield caption="Read Margin" mask="0x0000000F" name="RM0"/>
          <bitfield caption="Read Margin" mask="0x000000F0" name="RM1"/>
          <bitfield caption="Read Margin" mask="0x00000F00" name="RM2"/>
          <bitfield caption="Read Margin" mask="0x0000F000" name="RM3"/>
          <bitfield caption="Read Margin Enable" mask="0x00010000" name="RME0"/>
          <bitfield caption="Read Margin Enable" mask="0x00020000" name="RME1"/>
          <bitfield caption="Read Margin Enable" mask="0x00040000" name="RME2"/>
          <bitfield caption="Read Margin Enable" mask="0x00080000" name="RME3"/>
          <bitfield caption="Light Sleep Mode" mask="0x01000000" name="LS"/>
          <bitfield caption="Deep Sleep Mode" mask="0x02000000" name="DS"/>
          <bitfield caption="Shutdown Mode" mask="0x04000000" name="SD"/>
        </register>
        <register caption="CPKCC Memory Configuration Register" name="SFR_CPKCC" offset="0x30" rw="RW" size="4">
          <bitfield caption="ROM Read Margin" mask="0x0000000F" name="ROM_RM"/>
          <bitfield caption="ROM Read Margin Enable" mask="0x00000010" name="ROM_RME"/>
          <bitfield caption="ROM Light Sleep Mode" mask="0x00000100" name="ROM_LS"/>
          <bitfield caption="Shutdown Mode" mask="0x00000200" name="ROM_SD"/>
          <bitfield caption="RAM Read Margin" mask="0x000F0000" name="RAM_RM"/>
          <bitfield caption="RAM Read Margin Enable" mask="0x00100000" name="RAM_RME"/>
          <bitfield caption="RAM Light Sleep Mode" mask="0x01000000" name="RAM_LS"/>
          <bitfield caption="RAM Deep Sleep Mode" mask="0x02000000" name="RAM_DS"/>
          <bitfield caption="Shutdown Mode" mask="0x04000000" name="RAM_SD"/>
        </register>
        <register caption="HROMC Memory Configuration Register" name="SFR_HROMC" offset="0x40" rw="RW" size="4">
          <bitfield caption="Read Margin" mask="0x0000000F" name="RM"/>
          <bitfield caption="Read Margin Enable" mask="0x00000010" name="RME"/>
          <bitfield caption="HROMC Light Sleep Mode" mask="0x00000100" name="LS"/>
          <bitfield caption="Shutdown Mode" mask="0x00000200" name="SD"/>
        </register>
        <register caption="HCACHEI Valid Memory Configuration Register" name="SFR_HCACHEI_VALID" offset="0x50" rw="RW" size="4">
          <bitfield caption="Read Margin" mask="0x0000000F" name="RM"/>
          <bitfield caption="Read Margin Enable" mask="0x00000010" name="RME"/>
          <bitfield caption="Light Sleep Mode" mask="0x00000100" name="LS"/>
          <bitfield caption="Deep Sleep Mode" mask="0x00000200" name="DS"/>
          <bitfield caption="Shutdown Mode" mask="0x00000400" name="SD"/>
        </register>
        <register caption="HCACHEI Data Memory Configuration Register" name="SFR_HCACHEI_DATA" offset="0x54" rw="RW" size="4">
          <bitfield caption="Read Margin" mask="0x0000FFFF" name="RM"/>
          <bitfield caption="Read Margin Enable" mask="0x000F0000" name="RME"/>
          <bitfield caption="Light Sleep Mode" mask="0x00F00000" name="LS"/>
          <bitfield caption="Deep Sleep Mode" mask="0x0F000000" name="DS"/>
          <bitfield caption="Shutdown Mode" mask="0xF0000000" name="SD"/>
        </register>
        <register caption="HCACHEI Tag Memory Configuration Register" name="SFR_HCACHEI_TAG" offset="0x58" rw="RW" size="4">
          <bitfield caption="Read Margin" mask="0x0000FFFF" name="RM"/>
          <bitfield caption="Read Margin Enable" mask="0x000F0000" name="RME"/>
          <bitfield caption="Light Sleep Mode" mask="0x00F00000" name="LS"/>
          <bitfield caption="Deep Sleep Mode" mask="0x0F000000" name="DS"/>
          <bitfield caption="Shutdown Mode" mask="0xF0000000" name="SD"/>
        </register>
        <register caption="HCACHED Valid Memory Configuration Register" name="SFR_HCACHED_VALID" offset="0x60" rw="RW" size="4">
          <bitfield caption="Read Margin" mask="0x0000000F" name="RM"/>
          <bitfield caption="Read Margin Enable" mask="0x00000010" name="RME"/>
          <bitfield caption="Light Sleep Mode" mask="0x00000100" name="LS"/>
          <bitfield caption="Deep Sleep Mode" mask="0x00000200" name="DS"/>
          <bitfield caption="Shutdown Mode" mask="0x00000400" name="SD"/>
        </register>
        <register caption="HCACHED Data Memory Configuration Register" name="SFR_HCACHED_DATA" offset="0x64" rw="RW" size="4">
          <bitfield caption="Read Margin" mask="0x0000FFFF" name="RM"/>
          <bitfield caption="Read Margin Enable" mask="0x000F0000" name="RME"/>
          <bitfield caption="Light Sleep Mode" mask="0x00F00000" name="LS"/>
          <bitfield caption="Deep Sleep Mode" mask="0x0F000000" name="DS"/>
          <bitfield caption="Shutdown Mode" mask="0xF0000000" name="SD"/>
        </register>
        <register caption="HCACHEDTag Memory Configuration Register" name="SFR_HCACHED_TAG" offset="0x68" rw="RW" size="4">
          <bitfield caption="Read Margin" mask="0x0000FFFF" name="RM"/>
          <bitfield caption="Read Margin Enable" mask="0x000F0000" name="RME"/>
          <bitfield caption="Light Sleep Mode" mask="0x00F00000" name="LS"/>
          <bitfield caption="Deep Sleep Mode" mask="0x0F000000" name="DS"/>
          <bitfield caption="Shutdown Mode" mask="0xF0000000" name="SD"/>
        </register>
        <register caption="Flash Memory Configuration Register" name="SFR_FLASH" offset="0x70" rw="RW" size="4">
          <bitfield caption="" mask="0x00000001" name="PATCH_BYPASS"/>
        </register>
        <register caption="Optical Link Register" name="SFR_OPT_LINK" offset="0x80" rw="RW" size="4">
          <bitfield caption="Clock Selection" mask="0x00000001" name="CLK_SELECT"/>
        </register>
        <register caption="JTAG Register" name="SFR_JTAG" offset="0x90" rw="RW" size="4">
          <bitfield caption="JTAG Lock" mask="0x00000001" name="JTAG_LOCK"/>
        </register>
